In [2]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [7]:
df = pd.read_excel('./default of credit card clients.xls')

In [ ]:
df.head()

,Unnamed: 0,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0

In [15]:
df.rename(columns = {'Unnamed: 0': 'ID'}, inplace=True)

In [16]:
df.head()

,ID,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0

In [17]:
print(df.columns)

Index(['ID', 'X1', 'X2', 'X3', 'X4', 'X5', 'X6', 'X7', 'X8', 'X9', 'X10',
       'X11', 'X12', 'X13', 'X14', 'X15', 'X16', 'X17', 'X18', 'X19', 'X20',
       'X21', 'X22', 'X23', 'Y'],
      dtype='object')

#### EDA

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30001 entries, 0 to 30000
Data columns (total 25 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  30001 non-null  object
 1   X1          30001 non-null  object
 2   X2          30001 non-null  object
 3   X3          30001 non-null  object
 4   X4          30001 non-null  object
 5   X5          30001 non-null  object
 6   X6          30001 non-null  object
 7   X7          30001 non-null  object
 8   X8          30001 non-null  object
 9   X9          30001 non-null  object
 10  X10         30001 non-null  object
 11  X11         30001 non-null  object
 12  X12         30001 non-null  object
 13  X13         30001 non-null  object
 14  X14         30001 non-null  object
 15  X15         30001 non-null  object
 16  X16         30001 non-null  object
 17  X17         30001 non-null  object
 18  X18         30001 non-null  object
 19  X19         30001 non-null  object
 20  X20         30001 non-null  object
 21  X21         30001 non-null  object
 22  X22         30001 non-null  object
 23  X23         30001 non-null  object
 24  Y           30001 non-null  object
dtypes: object(25)
memory usage: 5.7+ MB

In [ ]:
#convert datatypes to integer
for col in df.select_dtypes(include=[object]).columns:
    df[col] = pd.to_numeric(df[col], errors='coerce', downcast = 'integer')

In [20]:
print(df)

            ID        X1   X2   X3   X4    X5   X6   X7   X8   X9  ...  \
0          NaN       NaN  NaN  NaN  NaN   NaN  NaN  NaN  NaN  NaN  ...
1          1.0   20000.0  2.0  2.0  1.0  24.0  2.0  2.0 -1.0 -1.0  ...
2          2.0  120000.0  2.0  2.0  2.0  26.0 -1.0  2.0  0.0  0.0  ...
3          3.0   90000.0  2.0  2.0  2.0  34.0  0.0  0.0  0.0  0.0  ...
4          4.0   50000.0  2.0  2.0  1.0  37.0  0.0  0.0  0.0  0.0  ...
...        ...       ...  ...  ...  ...   ...  ...  ...  ...  ...  ...
29996  29996.0  220000.0  1.0  3.0  1.0  39.0  0.0  0.0  0.0  0.0  ...
29997  29997.0  150000.0  1.0  3.0  2.0  43.0 -1.0 -1.0 -1.0 -1.0  ...
29998  29998.0   30000.0  1.0  2.0  2.0  37.0  4.0  3.0  2.0 -1.0  ...
29999  29999.0   80000.0  1.0  3.0  1.0  41.0  1.0 -1.0  0.0  0.0  ...
30000  30000.0   50000.0  1.0  2.0  1.0  46.0  0.0  0.0  0.0  0.0  ...

           X15      X16      X17      X18      X19      X20     X21      X22  \
0          NaN      NaN      NaN      NaN      NaN      NaN     NaN      NaN
1          0.0      0.0      0.0      0.0    689.0      0.0     0.0      0.0
2       3272.0   3455.0   3261.0      0.0   1000.0   1000.0  1000.0      0.0
3      14331.0  14948.0  15549.0   1518.0   1500.0   1000.0  1000.0   1000.0
4      28314.0  28959.0  29547.0   2000.0   2019.0   1200.0  1100.0   1069.0
...        ...      ...      ...      ...      ...      ...     ...      ...
29996  88004.0  31237.0  15980.0   8500.0  20000.0   5003.0  3047.0   5000.0
29997   8979.0   5190.0      0.0   1837.0   3526.0   8998.0   129.0      0.0
29998  20878.0  20582.0  19357.0      0.0      0.0  22000.0  4200.0   2000.0
29999  52774.0  11855.0  48944.0  85900.0   3409.0   1178.0  1926.0  52964.0
30000  36535.0  32428.0  15313.0   2078.0   1800.0   1430.0  1000.0   1000.0

          X23    Y
0         NaN  NaN
1         0.0  1.0
2      2000.0  1.0
3      5000.0  0.0
4      1000.0  0.0
...       ...  ...
29996  1000.0  0.0
29997     0.0  0.0
29998  3100.0  1.0
29999  1804.0  1.0
30000  1000.0  1.0

[30001 rows x 25 columns]

In [ ]:
#drop duplicate row
df=df.drop(index=0)

In [23]:
print(df)
print(df.dtypes)

            ID        X1   X2   X3   X4    X5   X6   X7   X8   X9  ...  \
1          1.0   20000.0  2.0  2.0  1.0  24.0  2.0  2.0 -1.0 -1.0  ...
2          2.0  120000.0  2.0  2.0  2.0  26.0 -1.0  2.0  0.0  0.0  ...
3          3.0   90000.0  2.0  2.0  2.0  34.0  0.0  0.0  0.0  0.0  ...
4          4.0   50000.0  2.0  2.0  1.0  37.0  0.0  0.0  0.0  0.0  ...
5          5.0   50000.0  1.0  2.0  1.0  57.0 -1.0  0.0 -1.0  0.0  ...
...        ...       ...  ...  ...  ...   ...  ...  ...  ...  ...  ...
29996  29996.0  220000.0  1.0  3.0  1.0  39.0  0.0  0.0  0.0  0.0  ...
29997  29997.0  150000.0  1.0  3.0  2.0  43.0 -1.0 -1.0 -1.0 -1.0  ...
29998  29998.0   30000.0  1.0  2.0  2.0  37.0  4.0  3.0  2.0 -1.0  ...
29999  29999.0   80000.0  1.0  3.0  1.0  41.0  1.0 -1.0  0.0  0.0  ...
30000  30000.0   50000.0  1.0  2.0  1.0  46.0  0.0  0.0  0.0  0.0  ...

           X15      X16      X17      X18      X19      X20     X21      X22  \
1          0.0      0.0      0.0      0.0    689.0      0.0     0.0      0.0
2       3272.0   3455.0   3261.0      0.0   1000.0   1000.0  1000.0      0.0
3      14331.0  14948.0  15549.0   1518.0   1500.0   1000.0  1000.0   1000.0
4      28314.0  28959.0  29547.0   2000.0   2019.0   1200.0  1100.0   1069.0
5      20940.0  19146.0  19131.0   2000.0  36681.0  10000.0  9000.0    689.0
...        ...      ...      ...      ...      ...      ...     ...      ...
29996  88004.0  31237.0  15980.0   8500.0  20000.0   5003.0  3047.0   5000.0
29997   8979.0   5190.0      0.0   1837.0   3526.0   8998.0   129.0      0.0
29998  20878.0  20582.0  19357.0      0.0      0.0  22000.0  4200.0   2000.0
29999  52774.0  11855.0  48944.0  85900.0   3409.0   1178.0  1926.0  52964.0
30000  36535.0  32428.0  15313.0   2078.0   1800.0   1430.0  1000.0   1000.0

          X23    Y
1         0.0  1.0
2      2000.0  1.0
3      5000.0  0.0
4      1000.0  0.0
5       679.0  0.0
...       ...  ...
29996  1000.0  0.0
29997     0.0  0.0
29998  3100.0  1.0
29999  1804.0  1.0
30000  1000.0  1.0

[30000 rows x 25 columns]
ID     float64
X1     float64
X2     float64
X3     float64
X4     float64
X5     float64
X6     float64
X7     float64
X8     float64
X9     float64
X10    float64
X11    float64
X12    float64
X13    float64
X14    float64
X15    float64
X16    float64
X17    float64
X18    float64
X19    float64
X20    float64
X21    float64
X22    float64
X23    float64
Y      float64
dtype: object

In [ ]:
#convert float64 datatype to int64
df = df.astype({col: 'int64' for col in df.select_dtypes(include = ['float64']).columns})

In [27]:
print(df)

          ID      X1  X2  X3  X4  X5  X6  X7  X8  X9  ...    X15    X16  \
1          1   20000   2   2   1  24   2   2  -1  -1  ...      0      0
2          2  120000   2   2   2  26  -1   2   0   0  ...   3272   3455
3          3   90000   2   2   2  34   0   0   0   0  ...  14331  14948
4          4   50000   2   2   1  37   0   0   0   0  ...  28314  28959
5          5   50000   1   2   1  57  -1   0  -1   0  ...  20940  19146
...      ...     ...  ..  ..  ..  ..  ..  ..  ..  ..  ...    ...    ...
29996  29996  220000   1   3   1  39   0   0   0   0  ...  88004  31237
29997  29997  150000   1   3   2  43  -1  -1  -1  -1  ...   8979   5190
29998  29998   30000   1   2   2  37   4   3   2  -1  ...  20878  20582
29999  29999   80000   1   3   1  41   1  -1   0   0  ...  52774  11855
30000  30000   50000   1   2   1  46   0   0   0   0  ...  36535  32428

         X17    X18    X19    X20   X21    X22   X23  Y
1          0      0    689      0     0      0     0  1
2       3261      0   1000   1000  1000      0  2000  1
3      15549   1518   1500   1000  1000   1000  5000  0
4      29547   2000   2019   1200  1100   1069  1000  0
5      19131   2000  36681  10000  9000    689   679  0
...      ...    ...    ...    ...   ...    ...   ... ..
29996  15980   8500  20000   5003  3047   5000  1000  0
29997      0   1837   3526   8998   129      0     0  0
29998  19357      0      0  22000  4200   2000  3100  1
29999  48944  85900   3409   1178  1926  52964  1804  1
30000  15313   2078   1800   1430  1000   1000  1000  1

[30000 rows x 25 columns]

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 1 to 30000
Data columns (total 25 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      30000 non-null  int64
 1   X1      30000 non-null  int64
 2   X2      30000 non-null  int64
 3   X3      30000 non-null  int64
 4   X4      30000 non-null  int64
 5   X5      30000 non-null  int64
 6   X6      30000 non-null  int64
 7   X7      30000 non-null  int64
 8   X8      30000 non-null  int64
 9   X9      30000 non-null  int64
 10  X10     30000 non-null  int64
 11  X11     30000 non-null  int64
 12  X12     30000 non-null  int64
 13  X13     30000 non-null  int64
 14  X14     30000 non-null  int64
 15  X15     30000 non-null  int64
 16  X16     30000 non-null  int64
 17  X17     30000 non-null  int64
 18  X18     30000 non-null  int64
 19  X19     30000 non-null  int64
 20  X20     30000 non-null  int64
 21  X21     30000 non-null  int64
 22  X22     30000 non-null  int64
 23  X23     30000 non-null  int64
 24  Y       30000 non-null  int64
dtypes: int64(25)
memory usage: 5.7 MB

In [29]:
df.head()

,ID,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
5,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [32]:
#check for mmissing values
df.isna()

,ID,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29996,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
29997,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
29998,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
29999,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
30000,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [ ]:
#Total sum of missing values for each columns
df.isna().sum()

ID     0
X1     0
X2     0
X3     0
X4     0
X5     0
X6     0
X7     0
X8     0
X9     0
X10    0
X11    0
X12    0
X13    0
X14    0
X15    0
X16    0
X17    0
X18    0
X19    0
X20    0
X21    0
X22    0
X23    0
Y      0
dtype: int64